Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་ནོར་བླ་ན་མེད་པ་གང་ཞེ་ན།
en: “Why is it the highest wealth?

source: འདི་ལྟ་སྟེ། ལྷ་དང་མིའི་སྐྱེ་དགུ་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱེད་པ་དང་། ཐར་པ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of an excellent rebirth as a deva or human and it brings the attainment of liberation.

source: །དེ་ལ་སྦྱིན་པ་ཟང་ཟིང་མེད་པ་གང་ཞེ་ན།
en: “Why is it immaterial generosity?

source: འདི་ལྟ་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་གཅོད་པའི་ཕྱིར་རོ།
en: Because it destroys all the kleśas.

source: །དེ་ལ་ན་བ་རྣམས་ཀྱི་རྩི་གང་ཞེ་ན།
en: “Why is it a medicine for the sick?

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings desire, anger, and ignorance to an end.

source: །དེ་ལ་མཛོད་ཤེས་པ་གང་ཞེ་ན།
en: “Why is it a treasure of wisdom?

source: འདི་ལྟ་སྟེ། བསྒོམ་པའི་ཕྱིར་རོ།
en: Because it is meditation.

source: །དེ་ལ་སྤོབས་པ་མི་ཟད་པ་གང་ཞེ་ན།
en: “Why is it unceasing eloquence?

source: འདི་ལྟ་སྟེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དང་མཐོང་བའི་ཕྱིར་རོ།
en: Because it is truly correct knowledge and vision.

source: །དེ་ལ་མྱ་ངན་དང་བྲལ་བ་གང་ཞེ་ན།
en: “Why is it freedom from misery?

source: འདི་ལྟ་སྟེ། གནོད་པ་དང་། སྡུག་བསྔལ་དོན་མེད་པར་རྟོགས་ཤིང་འབྱུང་བ་དང་། སྡུག་བསྔལ་བདག་མེད་པར་ཤེས་པའི་ཕྱིར་རོ།
en: Because it is the realization that harm and suffering are meaningless and that suffering has no self.

source: །དེ་ལ་ཁམས་གསུམ་ཡོངས་སུ་ཤེས་པ་གང་ཞེ་ན།
en: “Why is it the comprehension of the entire three realms?

source: འདི་ལྟ་སྟེ། སྒྱུ་མ་དང་རྨི་ལམ་ལྟ་བུར་རྟོགས་པའོ།
en: Because it is the realization that they are like dreams and illusions.

source: །དེ་ལ་ཕ་རོལ་ཏུ་འགྲོ་བ་དག་གི་གཟིངས་གང་ཞེ་ན།
en: “Why is it a raft for crossing to the other shore?

source: འདི་ལྟ་སྟེ། ལྷག་པའི་བསམ་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འདོད་པ་དག་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་ཉིད་དུ་སྒོམ་པའི་ཕྱིར་རོ།
en: Because it is the meditation on impermanence, suffering, and emptiness by those who have the higher motivation of desiring to attain nirvāṇa.

source: །དེ་ལ་ཆུ་བོའི་ནང་དུ་སོང་བ་དག་གི་གྲུ་གང་ཞེ་ན།
en: “Why is it like a boat for those in the middle of a river?

source: འདི་ལྟ་སྟེ། མྱ་ངན་ལས་འདའ་བ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of nirvāṇa.

source: །དེ་ལ་སྙན་པ་འདོད་པ་དག་གི་གྲགས་པ་གང་ཞེ་ན།
en: “Why is it fame for those who wish for renown?

source: འདི་ལྟ་སྟེ། ཆོས་རྒྱ་ཆེན་པོ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of vast qualities.

source: །དེ་ལ་སངས་རྒྱས་རྣམས་ཀྱི་བསྔགས་པ་གང་ཞེ་ན།
en: “Why do the buddhas praise it?

source: འདི་ལྟ་སྟེ། ཡོན་ཏན་མཐའ་ཡས་པའི་རྩིའི་སྦྱིན་བདག་ཏུ་གྱུར་པའི་ཕྱིར་རོ།
en: Because it is the benefactor that provides a medicine with infinite good qualities.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྙན་པ་གང་ཞེ་ན།
en: “Why do the tathāgatas laud it?

source: འདི་ལྟ་སྟེ། ཡོན་ཏན་དང་བདེ་བ་ཐམས་ཅད་དང་ཐར་པའི་སྦྱིན་བདག་ཏུ་གྱུར་པའི་ཕྱིར་རོ།
en: Because it is the benefactor that provides all qualities and happiness and liberation.

source: །དེ་ལ་སྟོབས་བཅུ་དག་གིས་བསྟོད་པ་གང་ཞེ་ན།
en: “Why do those who have the ten strengths praise it?

source: འདི་ལྟ་སྟེ། ཆོས་རིན་པོ་ཆེ་རྙེད་པར་དཀའ་བའི་སྦྱིན་བདག་ཏུ་གྱུར་པའི་ཕྱིར་རོ།
en: Because it is the benefactor that provides the precious Dharma that is difficult to find.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོན་ཏན་གང་ཞེ་ན།
en: “Why is it the quality of the bodhisattvas?

source: འདི་ལྟ་སྟེ། ཆོས་འདི་ལ་བསླབས་པའི་ཕྱིར་རོ།
en: Because it is the acquisition of training in the Dharma.

source: །དེ་ལ་སྙིང་རྗེ་ཅན་དག་གི་བཏང་སྙོམས་གང་ཞེ་ན།
en: “Why is it the equanimity of those with compassion?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་པའི་ཕྱིར་རོ།
en: Because it is the activity that accomplishes a buddha’s deeds.

source: །དེ་ལ་བྱམས་པས་ཞེ་སྡང་ཞི་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the love that brings evil to an end?

source: གཉེན་པོར་གྱུར་པའི་ཕྱིར་རོ།
en: Because it provides the remedy.

source: །དེ་ལ་ཐེག་པ་ཆེན་པོ་པ་རྣམས་དབུགས་འབྱིན་པ་གང་ཞེ་ན།
en: “Why does it provide relief for those who follow the Mahāyāna?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་རོ།
en: Because it fulfills all the wishes for the Buddha’s Dharma.

source: །དེ་ལ་སེང་གེའི་སྒྲ་སྒྲོག་པ་དག་གི་ནན་ཏན་གང་ཞེ་ན།
en: “Why is it the diligent practice of those with a lion’s roar?

source: འདི་ལྟ་སྟེ། ཆོས་ཀྱི་མཆོག་དང་ཆོས་ཀྱི་དམ་པ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of the best Dharma, the superior Dharma.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ལམ་གང་ཞེ་ན།
en: “Why is it the path of the wisdom of the buddhas?

source: འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of all good qualities.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་གང་ཞེ་ན།
en: “Why is it the seal upon all phenomena?

source: འདི་ལྟ་སྟེ། ཕ་རོལ་ནས་ཚུ་རོལ་རྟོགས་པའི་ཕྱིར་རོ།
en: Because it brings the realization of this side from the other side.

source: །དེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མི་འཕྲོགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བར་འགྱུར་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་སྒྲུབ་པ་དང་། ཐར་པ་ཐམས་ཅད་སྒྲུབ་པར་འགྱུར་བའོ།
en: “Why is it the accomplishment of omniscient wisdom? Because it eliminates all bad qualities, accomplishes all good qualities, and brings liberation to all beings.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེད་མོས་ཚལ་གང་ཞེ་ན།
en: “Why is it the pleasure garden of bodhisattvas?

source: འདི་ལྟ་སྟེ། བདག་གི་བདེ་བ་དང་དགའ་བ་དང་། མགུ་བ་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because their every happiness, joy, and pleasure bring happiness to all beings.

source: །དེ་ལ་བདུད་ཀྱི་སྡེ་རྣམས་འཇིག་པར་བྱེད་པ་གང་ཞེ་ན།
en: “Why does it terrify the māras?

source: འདི་ལྟ་སྟེ། སྟོབས་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it accomplishes all the strengths and because it brings all the kleśas to an end.

source: །དེ་ལ་བདེ་བར་འགྲོ་བའི་རིག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the knowledge of those who have reached happiness?

source: གཙེ་བ་ཐམས་ཅད་ཟད་པར་འགྱུར་བའོ།
en: Because it is the cessation of all distress.

source: །དེ་ལ་དོན་གྲུབ་པ་རྣམས་ཀྱི་དོན་གང་ཞེ་ན།
en: “Why is it the benefit from those who accomplish benefit?

source: འདི་ལྟ་སྟེ། ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of all good fortune.

source: །དེ་ལ་དགྲའི་ནང་དུ་སོང་བའི་སྐྱབས་གང་ཞེ་ན།
en: “Why is it the refuge for those among enemies?

source: འདི་ལྟ་སྟེ། དམིགས་པ་ཅན་ཐམས་ཅད་དང་ལོག་པར་ལྟ་བ་རྣམས་ཕམ་པར་བྱེད་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because it brings defeat to all those who believe in objective reality and have wrong views.

source: །དེ་ལ་ཆོས་དང་ལྡན་པས་མུ་སྟེགས་ཅན་རྣམས་ཚར་གཅོད་པ་གང་ཞེ་ན།
en: “Why is it the subjugation of adversaries by those who have the Dharma?

source: འདི་ལྟ་སྟེ། ཆོས་དང་ལྡན་པས་མུ་སྟེགས་ཅན་ཚར་གཅོད་པའོ།
en: Because it brings the defeat of the tīrthikas by those who have the Dharma.

source: །དེ་ལ་མི་འཇིགས་པའི་བདེན་པའི་རྣམ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཡོངས་སུ་བརྟག་པ་དང་། ཕྱིར་བརྟག་པ་བཟོད་པའི་ཕྱིར་རོ།
en: “Why is it the expression of truth for those who have fearlessness? Because it brings the tranquility of having analyzed well and analyzed precisely all phenomena.

source: །དེ་ལ་སྟོབས་རྣམས་ཡང་དག་པར་བཙལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the correct search for the strengths?

source: མ་ལོག་པའི་ཚུལ་གྱིས་སོ།
en: Because it is a practice that is not incorrect.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་སྔ་ལྟས་གང་ཞེ་ན།
en: “Why is it the omen for the eighteen unique qualities of a buddha?

source: འདི་ལྟ་སྟེ། དཀར་པོའི་ཆོས་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of all good qualities.

source: །དེ་ལ་རྒྱན་གང་ཞེ་ན།
en: “Why is it an adornment?

source: འདི་ལྟ་སྟེ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of the thirty-two primary signs of a great being.

source: །དེ་ལ་ཐར་པ་འདོད་པ་དག་གི་དགའ་བ་གང་ཞེ་ན།
en: “Why is it the delight of those who desire liberation?

source: འདི་ལྟ་སྟེ། ཐོག་མ་དང་དབུས་དང་ཐ་མར་དགེ་བའི་ཕྱིར་རོ།
en: Because it is good in the beginning, the middle, and the end.

source: །དེ་ལ་བུའི་ཐུ་བོ་དག་གི་དགའ་བ་གང་ཞེ་ན།
en: “Why is it the joy of the eldest sons?

source: འདི་ལྟ་སྟེ། ཕའི་ནོར་སངས་རྒྱས་ཀྱི་ནོར་མྱོང་བ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of experiencing their father’s wealth, the Buddha’s wealth.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྫོགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the completion of buddha wisdom?

source: དཀར་པོའི་ཆོས་ཐམས་ཅད་རྗེས་སུ་སྲུང་བ་དང་། དཀར་པོའི་ཆོས་ཐམས་ཅད་གཞན་མ་ཡིན་པར་གསོ་བ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the maintenance of all good qualities and the attainment of the cultivation of all good qualities and nothing else.

source: །དེ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་མ་ཡིན་པ་གང་ཞེ་ན།
en: “Why is it not the level of śrāvakas or pratyekabuddhas?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་རྒྱ་ཆེན་པོ་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of the vast, inconceivable qualities of buddhahood.

source: །དེ་ལ་སེམས་རྣམ་པར་དག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the purity of the mind?

source: དྲི་མ་ཐམས་ཅད་སྤོང་བར་འགྱུར་བའོ།
en: Because there is the elimination of all stains.

source: །དེ་ལ་ལུས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it the purity of the body?

source: ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བའི་ཕྱིར་རོ།
en: Because it brings the cessation of all illness.

source: །དེ་ལ་རྣམ་པར་ཐར་པ་འདོད་པ་རྣམས་ཀྱི་ཡོངས་སུ་རྫོགས་པ་གང་ཞེ་ན།
en: “Why is it the completion of the doorways to liberation?

source: འདི་ལྟ་སྟེ། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་དང་། ཞི་བར་སོ་སོར་རྟོག་པ་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of contemplating impermanence, suffering, emptiness, and selflessness.

source: །དེ་ལ་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་འཆི་བའི་གནས་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: “Why is it devoid of the kleśa of desire? Because it brings the accomplishment of the deathless state.

source: །དེ་ལ་ཞེ་སྡང་དང་བྲལ་བ་གང་ཞེ་ན།
en: “Why is it devoid of anger?

source: འདི་ལྟ་སྟེ། བྱམས་པ་ཆེན་པོ་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of great love.

source: །དེ་ལ་གཏི་མུག་གིས་མ་ཡིན་པ་གང་ཞེ་ན།
en: “Why is it not the level of ignorance?

source: འདི་ལྟ་སྟེ། ཆོས་ཡང་དག་པ་ཉིད་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of seeing phenomena as they truly are.

source: །དེ་ལ་ཡེ་ཤེས་འབྱུང་བ་གང་ཞེ་ན།
en: “Why is it the arising of wisdom?

source: འདི་ལྟ་སྟེ། འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་དགོས་པ་ཤེས་པ་ཐམས་ཅད་སྐྱེ་བའི་ཕྱིར་རོ།
en: Because it brings the development of knowing all that is necessary, both mundane and supramundane.

source: །དེ་ལ་རིག་པ་སྐྱེ་བ་གང་ཞེ་ན།
en: “Why is it the birth of knowledge?

source: འདི་ལྟ་སྟེ། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of all appropriate mental engagement.

source: །དེ་ལ་མ་རིག་པ་སྤོང་བ་གང་ཞེ་ན།
en: “Why is it the elimination of ignorance?

source: འདི་ལྟ་སྟེ། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because it brings freedom from all inappropriate mental engagement.

source: །དེ་ལ་རྣམ་པར་གྲོལ་བའི་སྙིང་པོས་ངོམས་པ་གང་ཞེ་ན།
en: “Why is it the contentment of those dedicated to liberation?

source: འདི་ལྟ་སྟེ། འཕགས་པའི་ཆེ་བ་ཉིད་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of noble greatness.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྙིང་པོར་བྱེད་པ་དག་གི་མགུ་བ་གང་ཞེ་ན།
en: “Why is it the satisfaction of those dedicated to samādhi?

source: འདི་ལྟ་སྟེ། བདེ་བ་དང་དགའ་བའི་བདེ་བ་ཐམས་ཅད་དང་། སེམས་རྩེ་གཅིག་པ་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of all bliss, joyful bliss, and a one-pointed mind.

source: །དེ་ལ་མཐོང་བར་འདོད་པ་རྣམས་ཀྱི་མིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it eyes for those who wish for the view?

source: བདག་ཉིད་ལྟ་བའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of seeing for oneself.

source: །དེ་ལ་རྣམ་པར་འཕྲུལ་པར་འདོད་པ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པ་གང་ཞེ་ན།
en: “Why is it higher knowledge for those who wish to perform miracles?

source: འདི་ལྟ་སྟེ། སྒྲིབ་པ་མེད་པ་དང་། འདོད་པར་འགྱུར་བའི་ཆོས་ཉིད་ཀྱི་ཕྱིར་རོ།
en: Because it brings freedom from obscuration and the desired true nature of phenomena.

source: །དེ་ལ་མངོན་པར་སྒྲུབ་པར་འདོད་པ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it miraculous power for those who wish for accomplishment?

source: ཆོས་ཐམས་ཅད་ལ་མི་རྟོག་པའི་ཤེས་པ་སྒྲིབ་པ་མེད་པའི་ཕྱིར་རོ།
en: Because it brings the accomplishment of the unobscured, inconceivable knowledge of all phenomena.

source: །དེ་ལ་ཐོས་པར་འདོད་པ་རྣམས་ཀྱི་གཟུངས་གང་ཞེ་ན།
en: “Why is it retentive memory for those dedicated to listening to the Dharma?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་པའི་ཕྱིར་རོ།
en: Because it brings the equality of all phenomena and nirvāṇa.

source: འདི་ལྟ་སྟེ། མྱ་ངན་ལས་འདས་པར་དམིགས་པ་རང་བཞིན་གྱིས་རྣམ་པར་ཞི་བའི་ཕྱིར་རོ།
en: Because it is the natural peace of focusing upon nirvāṇa.

source: །དེ་ལ་སངས་རྒྱས་རྣམས་ཀྱི་བྱིན་གྱི་རླབས་གང་ཞེ་ན།
en: “Why is it the blessing of the buddhas?

source: འདི་ལྟ་སྟེ། མཐའ་ཡས་པ་ཡོངས་སུ་སྒྲུབ་པའི་ཕྱིར་རོ།
en: Because it brings infinite accomplishment.

source: །དེ་ལ་མགོན་པོ་རྣམས་ཀྱི་ཐབས་མཁས་པ་གང་ཞེ་ན།
en: “Why is it the skillful method of the guides?

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་བདེ་བ་དང་ལེགས་པར་འགྲོ་བའི་ཕྱིར་རོ།
en: Because it conveys all to happiness and goodness.

source: །དེ་ལ་ཕྲ་མོ་གང་ཞེ་ན།
en: “Why is it subtle?

source: འདི་ལྟ་སྟེ། མྱ་ངན་ལས་འདས་པ་ལ་དམིགས་པ་རྣམ་པར་ཞི་བའི་ཕྱིར་རོ།
en: Because it brings the peace of focusing on nirvāṇa.

source: །དེ་ལ་ཤེས་པར་དཀའ་བ་གང་ཞེ་ན།
en: “Why is it difficult to know?

source: འདི་ལྟ་སྟེ། སོ་སོར་རིག་པར་དཀའ་བའི་ཕྱིར་རོ།
en: Because it is difficult to discern.

source: །དེ་ལ་མི་བརྩོན་པ་རྣམས་ཀྱིས་རིག་པར་དཀའ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it difficult to know for those without dedication?

source: སྔོན་མ་ཐོས་པའི་ཕྱིར་རོ།
en: Because they have not previously obtained it.

source: །དེ་ལ་ཡི་གེ་རྣམས་ལྡོག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚིག་གི་ལམ་ཐམས་ཅད་མི་དམིགས་པའི་ཕྱིར་རོ། །དེ་ལ་སྒྲས་ཤེས་པར་དཀའ་བ་གང་ཞེ་ན།
en: “Why is it beyond words and difficult to know through speech?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་རོ།
en: Because of the inconceivability of all phenomena.

source: །དེ་ལ་མཁས་པ་དག་གིས་ཡོངས་སུ་ཤེས་པ་གང་ཞེ་ན།
en: “Why is it known by the wise?

source: འདི་ལྟ་སྟེ། རིན་པོ་ཆེ་དོན་ཆེ་བའི་ཕྱིར་རོ།
en: Because it is a great, precious meaning.

source: །དེ་ལ་ངེས་པ་དག་གིས་ཤེས་པ་གང་ཞེ་ན།
en: “Why is it the knowledge of pleasant beings?

source: འདི་ལྟ་སྟེ། བཀུར་སྟི་ཀུན་ཤེས་པའི་ཕྱིར་རོ།
en: Because they know all forms of reverence.

source: །དེ་ལ་འདོད་པ་ཉུང་བས་རྟོགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it realized by those with few desires?

source: བཀུར་སྟི་མི་སྐྱེད་པའི་ཕྱིར་རོ།
en: Because they give rise to reverence.

source: །དེ་ལ་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱིས་གཟུང་བ་གང་ཞེ་ན།
en: “Why is it possessed by those who have undertaken it?

source: འདི་ལྟ་སྟེ། བརྩོན་པ་མི་འདོར་བའི་ཕྱིར་རོ།
en: Because they do not abandon their undertaking.

source: །དེ་ལ་དྲན་པ་ཅན་གྱིས་བཅངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why is it kept by those who are mindful?

source: བྱས་པ་ཆུད་མི་ཟ་བའི་ཕྱིར་རོ།
en: Because they do not allow it to perish.

source: །དེ་ལ་སྡུག་བསྔལ་ཟད་པ་གང་ཞེ་ན།
en: “Why is it the cessation of suffering?

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤོང་བར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because it brings the elimination of desire, anger, and ignorance.

source: །དེ་ལ་ཆོས་མི་སྐྱེ་བ་གང་ཞེ་ན།
en: “Why is it the birthlessness of all phenomena?

source: འདི་ལྟ་སྟེ། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་འགོག་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because it brings the cessation of all consciousness.

source: །དེ་ལ་བསྟན་པ་གཅིག་གང་ཞེ་ན།
en: “Why is it the single teaching?

source: འདི་ལྟ་སྟེ། སྲིད་པའི་འགྲོ་བ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བའི་གནས་ཐམས་ཅད་ཀྱི་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུའོ་ཞེས་ཆོས་ཐམས་ཅད་མི་སྐྱེད་པའི་ཕྱིར་རོ།
en: Because all classes of existence, all death and transference, and all rebirths are like dreams, which means that all phenomena are without origination.

source: །འདི་ནི་ཚིག་སུམ་བརྒྱ་པོ་འདི་རྣམས་རྒྱས་པར་བསྟན་པར་རིག་པར་བྱ་སྟེ།
en: “You should know these three hundred points.

source: གཞོན་ནུ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: Young man, they are the samādhi, the revealed equality of the nature of all phenomena.”

source: །སངས་རྒྱས་ཆོས་ནི་རྒྱ་ཆེ་སྟེ།
en: “The Buddha’s Dharma is vast.

source: །ཚུལ་ཡང་རྒྱ་ཆེར་བསྟན་པ་ཡིན།
en: The teaching of its practice is vast.

source: །ཆོས་རྣམས་རྒྱ་ཆེར་བསྟན་པས་ན།
en: When the Dharma is taught in a vast way

source: །ཡོན་ཏན་རྒྱ་ཆེན་ཐོབ་པར་འགྱུར།
en: The qualities attained will be vast. {1} “The characteristics of the Dharma

source: །ཇི་ལྟར་ནམ་མཁའ་རྒྱ་ཆེ་བ། །ཆོས་ཀྱི་མཚན་ཉིད་དེ་བཞིན་ཏེ།
en: Are just as vast as space.

source: །རིན་ཆེན་འོད་ཟེར་རྒྱ་ཆེན་གང་།
en: It contains vast jewels and light rays

source: །དེ་ཕྱིར་ཤིན་ཏུ་རྒྱས་ཞེས་བྱ།
en: And therefore it is called vast. {2}

source: །སེམས་ཅན་སྤྱོད་པ་རྒྱ་ཆེ་སྟེ།
en: “The ways beings act are vast,

source: །དེ་དག་བསྟན་པའང་རྒྱ་ཆེའོ།
en: The teachings for them are vast,

source: །ལུང་གི་དོན་ཡང་རྒྱ་ཆེ་བས།
en: The meaning of the scripture is vast,

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When the Bhagavān taught this Dharma teaching of the samādhi, the revealed equality of the nature of all phenomena, countless beings developed the aspiration for complete enlightenment.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: Countless beings attained irreversibility from the highest, complete enlightenment.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་རང་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: Countless beings developed the aspiration for their own enlightenment.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བ་ལ་སེམས་སྐྱེས་སོ།
en: Countless beings developed the aspiration for attaining the result of becoming an arhat.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས།
en: This universe of a thousand million worlds shook in six ways.

source: འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: It trembled, trembled strongly, and trembled intensely;

source: ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག །འཁྲུགས་རབ་ཏུ་འཁྲུགས།
en: it quivered, quivered strongly, and quivered intensely; it shook, shook strongly, and shook intensely;

source: ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ།
en: it shuddered, shuddered strongly, and shuddered intensely;

source: ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ། འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ།
en: it quaked, quaked strongly, and quaked intensely;

source: ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ། བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ། ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ། མཐའ་དམའ་ན་དབུས་མཐོ། དབུས་དམའ་ན་མཐའ་མཐོ་སྟེ།
en: the east sank and the west rose, the west sank and the east rose, the north sank and the south rose, the south sank and the north rose, the perimeter sank and the center rose, and the center sank and the perimeter rose.

source: འཇིག་རྟེན་ཀུན་ཏུ་སྣང་བ་དཔག་ཏུ་མེད་པ་དག་བྱུང་བར་གྱུར་ཏོ། །ལྷའི་སྤོས་ཀྱི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་བབ་བོ། །ལྷ་དག་ཀྱང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་འབེབས་སོ། །ལྷའི་སིལ་སྙན་བརྒྱ་སྟོང་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་རྡུང་ངོ་། །ལྷའི་ན་བཟའ་དག་ཀྱང་སྟེང་གི་ནམ་མཁའ་ལ་གཡོགས་ཤིང་ཚིག་འདི་སྐད་ཅེས་ཟེར་རོ།
en: In all the world there shone an immeasurable radiance, there fell a great rain of divine incense, the devas threw down a great rain of flowers, hundreds of thousands of divine musical instruments were played up in the sky, the sky above was covered with divine food, and these words were spoken:

source: །གང་གིས་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་རྙེད་པ་ལེགས་པར་རྙེད་པ་ཡིན་ཏེ། སེམས་ཅན་དེ་དག་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པར་འགྱུར་རོ།
en: “The beings who hear this Dharma teaching on entering great compassion will easily reach attainment, and those beings will serve and honor many buddhas.

source: །གང་གིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོས་པར་འགྱུར་ཞིང་ཐོས་ནས་ཀྱང་ཡི་གེར་འདྲི་བ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཉོན་མོངས་པ་མེད་པར་སྒོམ་པས་བསྒོམ་པ་དང་། མང་དུ་བྱེད་པ་དང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱིན་གནས་སུ་འགྱུར་རོ།
en: “Those who hear this samādhi, the revealed equality of the nature of all phenomena, and, having heard it, write it out, possess it, keep it, recite it to others, promote it, meditate on it with unadulterated meditation, promulgate it, and teach it extensively to others will become the subject of offerings from all beings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ཀྱིས་ཟུང་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the Bhagavān said to Brother Ānanda, “Ānanda, you must hold this Dharma teaching, recite it, promulgate it, and teach it extensively to others.”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: Then Brother Ānanda asked the Bhagavān, “What is the name of this teaching?

source: ཇི་ལྟར་གཟུང་བར་བགྱི།
en: In what way shall I keep it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་མདོ་སྡེ་འདི་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །ཀུན་དགའ་བོས་གསོལ་པ།
en: The Bhagavān said, “Ānanda, you should keep this sūtra as having the name Entering Great Compassion. You should also keep this sūtra as having the name The Samādhi, the Revealed Equality of the Nature of All Phenomena.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་གིས་བཟུང་ལགས་སོ།
en: Ānanda said, “Bhagavān, I shall keep this Dharma teaching.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དེ་དག་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དུ་མ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: The Bhagavān, having spoken those words, the youth Candraprabha, Brother Ānanda, the fourfold assembly of bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās, the devas of Śuddhāvāsa, and the world with its devas, humans, asuras, and gandharvas rejoiced and praised the words of the Bhagavān.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ཇི་སྙེད་པ་རྫོགས་སྷོ།། །།
en: “The Samādhi, the Revealed Equality of the Nature of All Phenomena,” is concluded. Colophon

source: རྒྱ་གར་གྱི་མཁན་པོ་ཤཱི་ལེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་དྷརྨ་ཏཱ་ཤཱི་ལས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: The Indian preceptor Śrīlendrabodhi, and the chief editor Lotsawa Bandé Dharmatāśīla, translated and revised this work. It was later modified and finalized in terms of the new translation.
